run/PhaseChange/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       23780;
    }
    left
    {
        type            wall;
        inGroups        1(wall);
        nFaces          120;
        startFace       23880;
    }
    right
    {
        type            wall;
        inGroups        1(wall);
        nFaces          120;
        startFace       24000;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       24120;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          12000;
        startFace       24220;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          12000;
        startFace       36220;
    }
)

// ************************************************************************* //
